src/InformationRegisters/ЖурналЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЖурналЗапросов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗапросов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.HTTPСервисы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешнееПриложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ApiKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазовыйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтносительныйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HTTPШаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UserToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЭвотор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исходящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>UIDЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗапросов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>TimedOut</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенСОшибками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начало</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаApiKey</Name>
					<Comment>Не передан ApiKey</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаАвторизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаВнешнейСистемы</Name>
					<Comment>Не найдена внешняя система</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаСоединения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ЖурналЗапросов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеЗапроса = ПолучитьПараметрыЗапроса(Запись.UIDЗапроса, Запись.Период);	
	
	ЭтаФорма.Заголовок = "HTTP-сервис: "+ ЭтотОбъект.Запись.Тип +"    "+ "'"+ЭтотОбъект.Запись.HTTPШаблон+"'";
	
	Если Не ДанныеЗапроса = Неопределено Тогда		
		Для Каждого СтрокаТЧ из ДанныеЗапроса.Заголовки Цикл
			НоваяСтрока = ЭтотОбъект.Заголовки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ); 			
		КонецЦикла;
		
		Если Не Запись.Исходящий Тогда
			Для Каждого СтрокаТЧ из ДанныеЗапроса.ПараметрыURL Цикл
				НоваяСтрока = ЭтотОбъект.ПараметрыURL.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ); 			
			КонецЦикла;
			
			Для Каждого СтрокаТЧ из ДанныеЗапроса.ПараметрыЗапроса Цикл
				НоваяСтрока = ЭтотОбъект.ПараметрыЗапроса.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ); 			
			КонецЦикла;
		КонецЕсли;

		ТелоЗапроса = СтрЗаменить(ДанныеЗапроса.ТелоЗапроса, ",", "," + Символы.ПС);
		ОтветJSON   = ДанныеЗапроса.ОтветJSON;		
		
		Если (Запись.HTTPШаблон = "rating" ИЛИ Запись.HTTPШаблон = "record"
			 ИЛИ Запись.HTTPШаблон = "request" ИЛИ Запись.HTTPШаблон = "lead") 
			 И Запись.HTTPМетод = "GET" Тогда
			Элементы.ОтветJSON.Вид = ВидПоляФормы.ПолеHTMLДокумента;			
			Элементы.ОтветJSON.Ширина = 64;
			Элементы.ОтветJSON.РастягиватьПоГоризонтали = Ложь;
			Элементы.ОтветJSON.Доступность = Ложь;
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаСтраницы.Видимость = Ложь;
		Элементы.ГруппаОшибка.Видимость   = Истина;
	КонецЕсли;
	
	Если Запись.Статус = Перечисления.СтатусыЗапросов.Выполнен Тогда
		Элементы.Статус.ЦветТекста = Новый Цвет(0,150,70);
	Иначе
		Элементы.Статус.ЦветТекста = Новый Цвет(255,0,0);
	КонецЕсли;
	
	Если Запись.КодСостояния = 500 ИЛИ Запись.КодСостояния = 400 Тогда
		Элементы.КодСостояния.ЦветТекста = Новый Цвет(255,0,0);
	КонецЕсли;
	
	Элементы.Объект.Видимость = ЗначениеЗаполнено(Запись.Объект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Процедура, возвращает параметры http запроса.
//
Функция ПолучитьПараметрыЗапроса(UIDЗапроса, Период)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("UIDЗапроса", UIDЗапроса);
	Запрос.УстановитьПараметр("Период"    , Период);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЖурналЗапросов.ПараметрыЗапроса КАК ПараметрыЗапроса
	|ИЗ
	|	РегистрСведений.ЖурналЗапросов КАК ЖурналЗапросов
	|ГДЕ
	|	ЖурналЗапросов.Период = &Период
	|	И ЖурналЗапросов.UIDЗапроса = &UIDЗапроса";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ПараметрыЗапроса.Получить(), Неопределено);	
	
КонецФункции  

#КонецОбласти
